vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.LPC55S04_DFP.pdsc
    <condition id="driver.pf1550.condition_id">
      <require condition="allOf.anyOf=driver.flexcomm_i2c, driver.common, device=LPC55S04.internal_condition"/>
    </condition>
    <condition id="driver.pf3000.condition_id">
      <require condition="allOf.anyOf=driver.flexcomm_i2c, driver.common, device=LPC55S04.internal_condition"/>
    </condition>
    <condition id="driver.pf5020.condition_id">
      <require condition="allOf.anyOf=driver.flexcomm_i2c, driver.common, device=LPC55S04.internal_condition"/>
    </condition>
    <condition id="driver.pint.condition_id">
      <require condition="allOf.driver.common, device_id=LPC55S04.internal_condition"/>
    </condition>
    <condition id="driver.plu.condition_id">
      <require condition="allOf.driver.common, device_id=LPC55S04.internal_condition"/>
    </condition>
    <condition id="driver.power.condition_id">
      <require condition="allOf.device=LPC55S04.internal_condition"/>
    </condition>
    <condition id="driver.prince.condition_id">
      <require condition="allOf.driver.iap1, driver.puf, device=LPC55S04.internal_condition"/>
    </condition>
    <condition id="allOf.driver.iap1, driver.puf, device=LPC55S04.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="iap1"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="PUF"/>
      <require condition="device.LPC55S04.internal_condition"/>
    </condition>
    <condition id="driver.psp27801.condition_id">
      <require condition="allOf.driver.common, device=LPC55S04.internal_condition"/>
    </condition>
    <condition id="driver.puf.condition_id">
      <require condition="allOf.driver.common, device_id=LPC55S04.internal_condition"/>
    </condition>
    <condition id="driver.reset.condition_id">
      <require condition="allOf.device=LPC55S04.internal_condition"/>
    </condition>
    <condition id="driver.rng_1.condition_id">
      <require condition="allOf.driver.common, device_id=LPC55S04.internal_condition"/>
    </condition>
    <condition id="driver.sctimer.condition_id">
      <require condition="allOf.driver.common, device_id=LPC55S04.internal_condition"/>
    </condition>
    <condition id="driver.sgtl5000.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.sgtl_adapter, driver.codec, device=LPC55S04.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.sgtl_adapter, driver.codec, device=LPC55S04.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="sgtl_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.LPC55S04.internal_condition"/>
    </condition>
    <condition id="driver.ssd1963.condition_id">
      <require condition="allOf.driver.dbi, device=LPC55S04.internal_condition"/>
    </condition>
    <condition id="allOf.driver.dbi, device=LPC55S04.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dbi"/>
      <require condition="device.LPC55S04.internal_condition"/>
    </condition>
    <condition id="driver.st7796s.condition_id">
      <require condition="allOf.driver.dbi, device=LPC55S04.internal_condition"/>
    </condition>
    <condition id="driver.sysctl.condition_id">
      <require condition="allOf.driver.common, device_id=LPC55S04.internal_condition"/>
    </condition>
    <condition id="driver.tfa9896.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.tfa9896_adapter, driver.codec, device=LPC55S04.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.tfa9896_adapter, driver.codec, device=LPC55S04.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="tfa9896_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.LPC55S04.internal_condition"/>
    </condition>
    <condition id="driver.tfa9xxx.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.tfa9xxx_adapter, driver.codec, device=LPC55S04.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.tfa9xxx_adapter, driver.codec, device=LPC55S04.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="tfa9xxx_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.LPC55S04.internal_condition"/>
    </condition>
    <condition id="driver.tfa9xxx_hal.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, driver.codec, driver.tfa9xxx, device=LPC55S04.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, driver.codec, driver.tfa9xxx, device=LPC55S04.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="tfa9xxx"/>
      <require condition="device.LPC55S04.internal_condition"/>
    </condition>
    <condition id="driver.tma525b.condition_id">
      <require condition="allOf.device=LPC55S04.internal_condition"/>
    </condition>
    <condition id="driver.tsl2561.condition_id">
      <require condition="allOf.anyOf=driver.flexcomm_i2c, driver.common, device=LPC55S04.internal_condition"/>
    </condition>
    <condition id="driver.utick.condition_id">
      <require condition="allOf.driver.common, device_id=LPC55S04.internal_condition"/>
    </condition>
    <condition id="driver.video-common.condition_id">
      <require condition="allOf.driver.common, device=LPC55S04.internal_condition"/>
    </condition>
