vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.LPC55S04_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="usart_adapter" Cversion="1.0.0" condition="component.usart_adapter.condition_id">
      <description>Component usart_adapter</description>
      <files>
        <file category="header" name="components/uart/fsl_adapter_uart.h" projectpath="component/uart"/>
        <file category="sourceC" name="components/uart/fsl_adapter_usart.c" projectpath="component/uart"/>
        <file category="include" name="components/uart/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8524_adapter" Cversion="2.2.0" condition="component.wm8524_adapter.condition_id">
      <description>Component wm8524 adapter for single codec</description>
      <files>
        <file category="header" name="components/codec/port/wm8524/fsl_codec_wm8524_adapter.h" projectpath="codec/port/wm8524"/>
        <file category="sourceC" name="components/codec/port/wm8524/fsl_codec_wm8524_adapter.c" projectpath="codec/port/wm8524"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8524/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8904_adapter" Cversion="2.2.0" condition="component.wm8904_adapter.condition_id">
      <description>Component wm8904 adapter for single codec</description>
      <files>
        <file category="header" name="components/codec/port/wm8904/fsl_codec_wm8904_adapter.h" projectpath="codec/port/wm8904"/>
        <file category="sourceC" name="components/codec/port/wm8904/fsl_codec_wm8904_adapter.c" projectpath="codec/port/wm8904"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8904/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8960_adapter" Cversion="2.2.0" condition="component.wm8960_adapter.condition_id">
      <description>Component wm8960 adapter for single codecs</description>
      <files>
        <file category="header" name="components/codec/port/wm8960/fsl_codec_wm8960_adapter.h" projectpath="codec/port/wm8960"/>
        <file category="sourceC" name="components/codec/port/wm8960/fsl_codec_wm8960_adapter.c" projectpath="codec/port/wm8960"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8960/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8962_adapter" Cversion="2.2.0" condition="component.wm8962_adapter.condition_id">
      <description>Component wm8962 adapter for single codecs</description>
      <files>
        <file category="header" name="components/codec/port/wm8962/fsl_codec_wm8962_adapter.h" projectpath="codec/port/wm8962"/>
        <file category="sourceC" name="components/codec/port/wm8962/fsl_codec_wm8962_adapter.c" projectpath="codec/port/wm8962"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8962/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="LPC55S04_header" Cversion="1.0.0" condition="device.CMSIS.condition_id">
      <description>Device LPC55S04_cmsis</description>
      <files>
        <file category="header" name="devices/LPC55S04/fsl_device_registers.h" projectpath="device"/>
        <file category="header" name="devices/LPC55S04/LPC55S04.h" projectpath="device"/>
        <file category="header" name="devices/LPC55S04/LPC55S04_features.h" projectpath="device"/>
        <file category="header" name="devices/LPC55S04/LPC55S04_COMMON.h" projectpath="device"/>
        <file category="header" name="devices/LPC55S04/periph3/PERI_ADC.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC55S04/periph3/PERI_AHB_SECURE_CTRL.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC55S04/periph3/PERI_ANACTRL.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC55S04/periph3/PERI_CAN.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC55S04/periph3/PERI_CASPER.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC55S04/periph3/PERI_CDOG.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC55S04/periph3/PERI_CRC.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC55S04/periph3/PERI_CTIMER.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC55S04/periph3/PERI_DBGMAILBOX.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC55S04/periph3/PERI_DMA.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC55S04/periph3/PERI_FLASH.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC55S04/periph3/PERI_FLASH_CFPA.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC55S04/periph3/PERI_FLASH_CMPA.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC55S04/periph3/PERI_FLASH_KEY_STORE.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC55S04/periph3/PERI_FLASH_NMPA.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC55S04/periph3/PERI_FLASH_ROMPATCH.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC55S04/periph3/PERI_FLEXCOMM.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC55S04/periph3/PERI_GINT.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC55S04/periph3/PERI_GPIO.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC55S04/periph3/PERI_HASHCRYPT.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC55S04/periph3/PERI_I2C.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC55S04/periph3/PERI_I2S.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC55S04/periph3/PERI_INPUTMUX.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC55S04/periph3/PERI_IOCON.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC55S04/periph3/PERI_MRT.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC55S04/periph3/PERI_OSTIMER.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC55S04/periph3/PERI_PINT.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC55S04/periph3/PERI_PLU.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC55S04/periph3/PERI_PMC.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC55S04/periph3/PERI_PRINCE.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC55S04/periph3/PERI_PUF.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC55S04/periph3/PERI_PUF_SRAM_CTRL.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC55S04/periph3/PERI_RNG.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC55S04/periph3/PERI_RTC.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC55S04/periph3/PERI_SCT.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC55S04/periph3/PERI_SPI.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC55S04/periph3/PERI_SYSCON.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC55S04/periph3/PERI_SYSCTL.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC55S04/periph3/PERI_USART.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC55S04/periph3/PERI_UTICK.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC55S04/periph3/PERI_WWDT.h" projectpath="device/periph3"/>
        <file category="include" name="devices/LPC55S04/"/>
        <file category="include" name="devices/LPC55S04/periph3/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device" Cversion="1.0.0" condition="device.RTE.condition_id">
      <description>Rte_device</description>
      <files>
        <file category="header" attr="config" name="devices/LPC55S04/template/RTE_Device.h" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/LPC55S04/template/"/>
      </files>
    </component>
